app/Services/CtoService.php

    public function recalculateBalancesForCustomer(Customer $customer)
    {
        DB::beginTransaction();
        try {
            // Fetch all CTO records for the customer, ordered by effective date and then ID
            // Eager load creditUsages and consumedActivities to ensure remaining_credits is accurate
            $ctoRecords = $customer->ctoApplications()
                ->with(['creditUsages', 'consumedActivities'])
                ->get()
                ->sortBy(function($cto) {
                    // Ensure strict chronological order. Prioritize activities on the same date.
                    return $cto->effective_date->timestamp . ($cto->is_activity ? '0' : '1');
                })
                ->values(); // Re-index the collection after sorting

            $currentRunningBalance = 0.0;
            // This pool represents credits that are currently 'active' and not expired/consumed.
            // Key: cto_activity_id, Value: ['record', 'remaining', 'expiration_date', 'original_credits']
            // 'remaining' in this pool is the amount still available from that specific activity.
            $activeCreditPools = collect();

            // Reset existing CtoCreditUsage records for the customer to rebuild them from scratch.
            // This is crucial for accurate recalculation, especially after edits or deletions.
            CtoCreditUsage::whereIn('cto_absence_id', $ctoRecords->where('is_activity', false)->pluck('id'))
                          ->orWhereIn('cto_activity_id', $ctoRecords->where('is_activity', true)->pluck('id'))
                          ->delete();
---
select * from `cto_applications` where `cto_applications`.`customer_id` = 1 and `cto_applications`.`customer_id` is not null
select * from `cto_credit_usages` where `cto_credit_usages`.`cto_activity_id` in (4)
delete from `cto_credit_usages` where 0 = 1 or `cto_activity_id` in (4)

    public function getEligibleCtoBalance(Customer $customer, Carbon $asOfDate = null)
    {
        $asOfDate = $asOfDate ?? Carbon::now();

        // Debugging logs for getEligibleCtoBalance
        Log::debug("Calculating eligible CTO balance for customer ID: {$customer->id} as of {$asOfDate->format('Y-m-d')}");

        // Fetch all CTO activities for the customer that are not expired as of $asOfDate
        $eligibleActivities = $customer->ctoApplications()
            ->where('is_activity', true)
            ->with('creditUsages') // Eager load usages to correctly calculate remaining_credits
            ->get()
            ->filter(function($activity) use ($asOfDate) {
                // Filter out activities that have expired by the asOfDate
                $isExpired = $activity->isExpiredAt($asOfDate);
                if ($isExpired) {
                    Log::debug("  Activity ID {$activity->id} is expired as of {$asOfDate->format('Y-m-d')}. Expiration Date: {$activity->date_of_activity_end->copy()->addYear()->format('Y-m-d')}. Skipping.");
                }
                return !$isExpired;
            });
---
select * from `cto_applications` where `cto_applications`.`customer_id` = 1 and `cto_applications`.`customer_id` is not null and `is_activity` = 1