app/Services/LeaveService.php

    private function recalculateBalancesFromDate(Customer $customer, $fromDate)
    {
        // Get all leave applications (including credits) from the specified date onwards
        $leaves = LeaveApplication::where('customer_id', $customer->id)
            ->where(function($query) use ($fromDate) {
                $query->whereDate('inclusive_date_start', '>=', $fromDate)
                      ->orWhereDate('earned_date', '>=', $fromDate);
            })
            ->get()
            ->sortBy(function($leave) {
                // Create a sortable date - use the earliest relevant date for each record
                $dates = array_filter([
                    $leave->inclusive_date_start,
                    $leave->earned_date,
                    $leave->date_filed
                ]);

                if (empty($dates)) {
                    return now(); // fallback if no dates
                }

                $earliestDate = min($dates);

                // Return a combination of date and ID for consistent sorting
                return $earliestDate . '-' . str_pad($leave->id, 10, '0', STR_PAD_LEFT);
            });
---
select * from `leave_applications` where `customer_id` = 34 and (date(`inclusive_date_start`) >= '2025-04-21' or date(`earned_date`) >= '2025-04-21')

    private function getBalancesBeforeDate(Customer $customer, $beforeDate)
    {
        // Get all leave applications before the specified date
        $leaves = LeaveApplication::where('customer_id', $customer->id)
            ->where(function($query) use ($beforeDate) {
                $query->whereDate('inclusive_date_start', '<', $beforeDate)
                    ->orWhereDate('earned_date', '<', $beforeDate);
            })
            ->get()
            ->sortBy(function($leave) {
                // Create a sortable date - use the earliest relevant date for each record
                $dates = array_filter([
                    $leave->inclusive_date_start,
                    $leave->earned_date,
                    $leave->date_filed
                ]);

                if (empty($dates)) {
                    return '1900-01-01'; // very early date for records with no dates
                }

                $earliestDate = min($dates);
                return $earliestDate . '-' . str_pad($leave->id, 10, '0', STR_PAD_LEFT);
            });
---
select * from `leave_applications` where `customer_id` = 34 and (date(`inclusive_date_start`) < '2025-04-21' or date(`earned_date`) < '2025-04-21')