routes/web.php

select * from `offices`
select * from `positions`
---
use App\Position;

// All web-related routes should be wrapped in the 'web' middleware group
Route::middleware('web')->group(function () {

    Route::get('/', function () {
        $offices = Office::all();
        $positions = Position::all();
        return view('leave.select', compact('offices', 'positions'));
    })->name('leave.select');

    Route::any('/find-customer', [LeaveController::class, 'findCustomer'])->name('customer.find');


    // Customer management routes
    Route::get('/customers/create', [CustomerController::class, 'create'])->name('customers.create');
    Route::post('/customers', [CustomerController::class, 'store'])->name('customers.store');

    // Non-teaching (customer) routes
    Route::prefix('leave/customer')->group(function () {
        Route::get('/', [LeaveController::class, 'index'])->name('leave.customer.index');
        Route::post('/add-customer', [LeaveController::class, 'addCustomer'])->name('customer.add');
        Route::post('/submit-leave', [LeaveController::class, 'submitLeave'])->name('leave.submit');
        Route::put('/update-leave', [LeaveController::class, 'updateLeave'])->name('leave.update');