app/Customer.php

                break;
        }

        $this->save();
---
update `customers` set `updated_at` = '2025-07-02 06:45:12', `spl` = 1 where `id` = 35