app/Http/Controllers/CtoController.php

    public function index(Request $request)
    {
        $customer = null; // Initialize customer as null
        $leaveTypes = LeaveService::getLeaveTypes(); // Used for tab navigation in Blade, consistent with LeaveController

        if ($request->has('customer_id')) {
            $customer = Customer::find($request->customer_id);

            if ($customer) {
                // Always recalculate balances on page load to ensure data integrity
                $this->ctoService->recalculateBalancesForCustomer($customer);

                // Reload the ctoApplications relationship on the Customer model
                // Ensure 'ctoApplications' relationship is defined on your Customer model
                $customer->load('ctoApplications');
---
select * from `cto_applications` where `cto_applications`.`customer_id` in (1)