app/Http/Controllers/LeaveController.php

        public function index(Request $request)
        {
            $customer = null;
            $leaveTypes = LeaveService::getLeaveTypes();
            $message = '';

            if ($request->has('customer_id')) {
                $customer = Customer::with('office')->find($request->customer_id);
---
select * from `customers` where `customers`.`id` = '34' limit 1
select * from `offices` where `offices`.`id` in (1)

        public function findCustomer(Request $request)
        {
            $customer = Customer::whereRaw("CONCAT(surname, ', ', given_name, ' ', middle_name) = ?", [$request->name])
                ->first();
---
select * from `customers` where CONCAT(surname, ', ', given_name, ' ', middle_name) = 'Albeza, Marni B' limit 1

        public function deleteLeave(Request $request)
        {
            try {
                $request->validate([
                    'id' => 'required|integer',
                    'type' => 'required|in:leave,credit'
                ]);

                $leaveApplication = LeaveApplication::findOrFail($request->id);
                $leaveApplication->delete();
---
delete from `leave_applications` where `id` = 20

    public function customerAutocomplete(Request $request)
    {
        if (ob_get_level()) {
            ob_clean();
        }

        $search = $request->get('query');

        if (empty($search) || strlen($search) < 2) {
            return response()->json([]);
        }

        try {
            $results = Customer::where(function ($query) use ($search) {
                    $query->where('surname', 'LIKE', "%{$search}%")
                        ->orWhere('given_name', 'LIKE', "%{$search}%")
                        ->orWhere('middle_name', 'LIKE', "%{$search}%");
                })
                ->whereBetween('office_id', [1, 14])
                ->limit(10)
                ->get(['surname', 'given_name', 'middle_name', 'id'])
                ->map(function ($customer) {
                    return [
                        'id' => $customer->id,
                        'label' => trim("{$customer->surname}, {$customer->given_name} {$customer->middle_name}"),
                    ];
                })
                ->values()
                ->toArray();
---
select `surname`, `given_name`, `middle_name`, `id` from `customers` where (`surname` LIKE '%haen%' or `given_name` LIKE '%haen%' or `middle_name` LIKE '%haen%') and `office_id` between 1 and 14 limit 10